ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/dokumentScenario/UpdateDocument_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DokumentOpdater_I revision="gero et">
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>49705142-cb3f-4428-b507-c0235fc744be_TEST</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-11-29T12:04:22Z</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:Dokument>
                <ns:DokumentIdentifikation>
                    <ns:DokumentNummer>${Properties#DokumentNummer}</ns:DokumentNummer>
                </ns:DokumentIdentifikation>
                <ns:Aktering>true</ns:Aktering>
                <ns:DokumentOplysninger>
                    <ns:DokumentTitel>
                        <ns:Opdater>
                            <ns:DokumentTitel>${Properties#DokumentTitel}</ns:DokumentTitel>
                        </ns:Opdater>
                        <ns:SletMarkering>false</ns:SletMarkering>
                    </ns:DokumentTitel>
                    <ns:DokumentPartListe/>
                    <ns:DokumentHenvisningListe/>
                    <ns:DokumentErindringListe/>
                    <ns:DokumentFriDatoListe/>
                    <ns:DokumentFriOplysningListe/>
                </ns:DokumentOplysninger>
            </ns:Dokument>
        </ns:DokumentOpdater_I>
    </soapenv:Body>
</soapenv:Envelope>